# SiteSubRegion Properties

---
The SiteSubRegion type exposes the following members.
| Name| Description
---|---|---
| HostId|  The element id of the topography surface hosting this SiteSubRegion.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| TopographySurface|  The TopographySurface element which this SiteSubRegion represents.
Top
#### Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace